/*
   14. В  листьях  бинарного  дерева  указаны   идентификаторы
переменных,  в других вершинах - знаки арифметических операций
или функции SIN,  COS, TG, CTG, LOG, EXP. Возможны одноместные
операции типа '+' или '-'. В этом случае требуется только один
операнд.    Значения    переменных     известны.     Проверить
синтаксическую  правильность идентификаторов.  Выдать на экран
выражение в инфиксной форме со скобками.  Определить  значение
выражения.
Пример: ((-(((a1*bar)+c))-(((SIN(dors))-e)))) (11)
*/

#include  <iostream>
